In [25]:
import pandas as pd
import numpy as np

In [26]:
df = pd.read_csv(r"Data.csv")

In [27]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [28]:
# Drop

In [29]:
# df.drop('e', axis=1, inplace=True)

In [30]:
df['maths'].max()

95

In [31]:
df['maths'].min()

23

In [32]:
df['maths'].mean()

64.83333333333333

In [33]:
df['maths'].median()

77.5

In [34]:
df.describe() # it only works on mathematical or numerical problem

           maths        phy
count   6.000000   6.000000
mean   64.833333  63.333333
std    31.262864  20.046612
min    23.000000  29.000000
25%    39.750000  58.000000
50%    77.500000  68.500000
75%    86.000000  70.000000
max    95.000000  89.000000

In [35]:
# Value_count

In [36]:
df.name.value_counts()

tom      1
jhon     1
max      1
raj      1
shyam    1
ram      1
Name: name, dtype: int64

In [37]:
# nunique

In [38]:
df['result'].nunique() # Count

2

In [39]:
df['name'].unique() #exact value

array(['tom', 'jhon', 'max', 'raj', 'shyam', 'ram'], dtype=object)

In [40]:
from numpy.random import randn as rn

In [41]:
rn(5,3)

array([[-1.50587214, -0.71143338, -0.30728998],
       [ 0.25625324,  0.99690551,  0.23424807],
       [-0.29009424,  1.74752709,  0.37302665],
       [-0.44652029, -0.5291258 ,  0.17434499],
       [ 0.53325543,  0.36945366,  0.64779415]])

In [42]:
# Seed

In [43]:
np.random.seed(1)
r = rn(5,3)
r

array([[ 1.62434536, -0.61175641, -0.52817175],
       [-1.07296862,  0.86540763, -2.3015387 ],
       [ 1.74481176, -0.7612069 ,  0.3190391 ],
       [-0.24937038,  1.46210794, -2.06014071],
       [-0.3224172 , -0.38405435,  1.13376944]])

In [44]:
rdf = pd.DataFrame(r)

In [45]:
rdf

          0         1         2
0  1.624345 -0.611756 -0.528172
1 -1.072969  0.865408 -2.301539
2  1.744812 -0.761207  0.319039
3 -0.249370  1.462108 -2.060141
4 -0.322417 -0.384054  1.133769

In [46]:
# Loc and iloc

In [47]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [50]:
df.loc[[2,4],['name','result']] # Values

    name result
2    max   Fail
4  shyam   Fail

In [51]:
df.iloc[[2,4],[0,3]] # index

    name result
2    max   Fail
4  shyam   Fail

In [52]:
rdf

          0         1         2
0  1.624345 -0.611756 -0.528172
1 -1.072969  0.865408 -2.301539
2  1.744812 -0.761207  0.319039
3 -0.249370  1.462108 -2.060141
4 -0.322417 -0.384054  1.133769

In [54]:
rdf.iloc[0:3,0:2]

          0         1
0  1.624345 -0.611756
1 -1.072969  0.865408
2  1.744812 -0.761207

In [55]:
rdf >  0.5

       0      1      2
0   True  False  False
1  False   True  False
2   True  False  False
3  False   True  False
4  False  False   True

In [56]:
rdf[rdf>.5]

          0         1         2
0  1.624345       NaN       NaN
1       NaN  0.865408       NaN
2  1.744812       NaN       NaN
3       NaN  1.462108       NaN
4       NaN       NaN  1.133769

In [57]:
# fillna()

In [58]:
df

    name  maths  phy result
0    tom     80   70   Pass
1   jhon     75   67   Pass
2    max     28   55   Fail
3    raj     88   70   Pass
4  shyam     23   29   Fail
5    ram     95   89   Pass

In [59]:
# Concat()

In [60]:
df1 = pd.DataFrame({'A': ['A1','A2','A3','A4'], 'B': ['B1','B2','B3','B4'], 'C': ['C1','C2','C3','C4']}, index =[0,1,2,3])
df1

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A4  B4  C4

In [61]:
df2 = pd.DataFrame({'A': ['A5','A6','A7','A8'], 'B': ['B5','B6','B7','B8'], 'C': ['C5','C6','C7','C8']}, index =[4,5,6,7])
df2

    A   B   C
4  A5  B5  C5
5  A6  B6  C6
6  A7  B7  C7
7  A8  B8  C8

In [63]:
df_concat = pd.concat([df1,df2], axis=0)  # Row
df_concat

    A   B   C
0  A1  B1  C1
1  A2  B2  C2
2  A3  B3  C3
3  A4  B4  C4
4  A5  B5  C5
5  A6  B6  C6
6  A7  B7  C7
7  A8  B8  C8

In [64]:
df_concat = pd.concat([df1,df2], axis=1) # Column
df_concat

     A    B    C    A    B    C
0   A1   B1   C1  NaN  NaN  NaN
1   A2   B2   C2  NaN  NaN  NaN
2   A3   B3   C3  NaN  NaN  NaN
3   A4   B4   C4  NaN  NaN  NaN
4  NaN  NaN  NaN   A5   B5   C5
5  NaN  NaN  NaN   A6   B6   C6
6  NaN  NaN  NaN   A7   B7   C7
7  NaN  NaN  NaN   A8   B8   C8